junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_audio.c
/* SPDX-License-Identifier: Apache-2.0 */
#include "bk7259_ops.h"

#include <api/aosl_mm.h>
#include <api/aosl_thread.h>
#include <common/bk_err.h>
#include <components/bk_audio/audio_algorithms/aec_v3_algorithm_v2.h>
#include <components/bk_audio/audio_pipeline/audio_element.h>
#include <components/bk_audio/audio_pipeline/audio_pipeline.h>
#include <components/bk_audio/audio_pipeline/audio_port.h>
#include <components/bk_audio/audio_streams/onboard_mic_stream_v2.h>
#include <components/bk_audio/audio_streams/onboard_speaker_stream_v2.h>
#include <components/bk_audio/audio_streams/raw_stream.h>
#include "bk7259_platform_log.h"
#include <components/system.h>
#include <modules/pm.h>
#include <modules/wifi.h>
#include <modules/wifi_types.h>

#include <limits.h>
#include <stdbool.h>
#include <stdint.h>

#define MYBOT_AUDIO_RATE 16000
#define MYBOT_AUDIO_CHANNELS 1
#define MYBOT_CAPTURE_MIC_CHANNELS 2
#define MYBOT_AUDIO_BITS 16
#define MYBOT_AUDIO_BLOCK_BYTES 640U
#define MYBOT_AUDIO_POOL_BYTES (MYBOT_AUDIO_BLOCK_BYTES * 6U)
#define MYBOT_AUDIO_IO_TIMEOUT_MS 25
#define MYBOT_CAPTURE_DEVICE_BLOCKS 4
#define MYBOT_PLAYBACK_RAW_BLOCKS 8
#define TAG "mybot_audio"

typedef struct {
    aosl_lock_t lock;
    aosl_cond_t idle;
    unsigned int in_flight;
    bool started;
    bool stopping;
} io_state_t;

typedef struct {
    io_state_t io;
    audio_pipeline_handle_t pipeline;
    audio_element_handle_t raw;
    audio_element_handle_t device;
    audio_element_handle_t aec;
    audio_port_handle_t raw_port;
    bool raw_registered;
    bool device_registered;
    bool aec_registered;
    bool pm_acquired;
    bool playback_owner_reserved;
    bool failed;
} audio_context_t;

static aosl_static_lock_t s_audio_pm_lock = AOSL_STATIC_LOCK_INIT;
static unsigned int s_audio_pm_users;

/* onboard_speaker_stream_v2 keeps a process-wide singleton. Reserve it before
 * calling its init function so a second playback context cannot overwrite the
 * vendor global while the first context is still alive. */
static aosl_static_lock_t s_playback_owner_lock = AOSL_STATIC_LOCK_INIT;
static audio_context_t *s_playback_owner;

/* The V2 speaker stream keeps the DAC state in a process-wide element.  Keep
 * the published context behind a separate static lock so a volume callback
 * cannot race audio_context_release() and retain a freed speaker handle. */
static aosl_static_lock_t s_playback_gain_lock = AOSL_STATIC_LOCK_INIT;
static audio_context_t *s_playback_gain_context;

static bool playback_gain_context_is_usable(audio_context_t *ctx) {
    bool usable;

    if (!ctx || !ctx->device || !ctx->io.lock) {
        return false;
    }
    aosl_lock_lock(ctx->io.lock);
    usable = !ctx->io.stopping && !ctx->failed;
    aosl_lock_unlock(ctx->io.lock);
    return usable;
}

static int playback_owner_acquire(audio_context_t *ctx) {
    if (!ctx) {
        MYBOT_LOGE(TAG, "playback owner acquire: invalid context");
        return -1;
    }
    if (aosl_static_lock_lock(&s_playback_owner_lock) < 0) {
        MYBOT_LOGE(TAG, "playback owner lock failed");
        return -1;
    }
    if (s_playback_owner) {
        MYBOT_LOGW(TAG, "playback owner busy; rejecting second speaker pipeline");
        (void)aosl_static_lock_unlock(&s_playback_owner_lock);
        return -1;
    }
    s_playback_owner = ctx;
    ctx->playback_owner_reserved = true;
    (void)aosl_static_lock_unlock(&s_playback_owner_lock);
    MYBOT_LOGI(TAG, "playback owner acquired");
    return 0;
}

static void playback_owner_release(audio_context_t *ctx) {
    if (!ctx || !ctx->playback_owner_reserved) {
        return;
    }
    if (aosl_static_lock_lock(&s_playback_owner_lock) < 0) {
        MYBOT_LOGE(TAG, "playback owner release lock failed");
        return;
    }
    if (s_playback_owner == ctx) {
        s_playback_owner = NULL;
    }
    ctx->playback_owner_reserved = false;
    (void)aosl_static_lock_unlock(&s_playback_owner_lock);
    MYBOT_LOGI(TAG, "playback owner released");
}

int bk7259_audio_playback_gain_publish(void *opaque) {
    audio_context_t *ctx = opaque;

    if (!ctx || !ctx->device) {
        MYBOT_LOGW(TAG, "playback gain publish: speaker unavailable");
        return -1;
    }
    if (aosl_static_lock_lock(&s_playback_gain_lock) < 0) {
        MYBOT_LOGE(TAG, "playback gain publish lock failed");
        return -1;
    }
    if (s_playback_gain_context && s_playback_gain_context != ctx) {
        MYBOT_LOGW(TAG, "playback gain already owned by another speaker");
        (void)aosl_static_lock_unlock(&s_playback_gain_lock);
        return -1;
    }
    s_playback_gain_context = ctx;
    (void)aosl_static_lock_unlock(&s_playback_gain_lock);
    return 0;
}

void bk7259_audio_playback_gain_unpublish(void *opaque) {
    audio_context_t *ctx = opaque;

    if (!ctx || aosl_static_lock_lock(&s_playback_gain_lock) < 0) {
        if (ctx) {
            MYBOT_LOGE(TAG, "playback gain unpublish lock failed");
        }
        return;
    }
    if (s_playback_gain_context == ctx) {
        s_playback_gain_context = NULL;
    }
    (void)aosl_static_lock_unlock(&s_playback_gain_lock);
}

int bk7259_audio_playback_gain_set(float gain_db) {
    int result = -1;

    if (aosl_static_lock_lock(&s_playback_gain_lock) < 0) {
        MYBOT_LOGE(TAG, "playback gain set lock failed");
        return -1;
    }
    if (s_playback_gain_context && playback_gain_context_is_usable(s_playback_gain_context) &&
        onboard_speaker_stream_set_digital_gain(s_playback_gain_context->device, gain_db) == BK_OK) {
        result = 0;
    }
    if (result < 0) {
        MYBOT_LOGW(TAG, "playback gain set unavailable or rejected (%.2f dB)", gain_db);
    }
    (void)aosl_static_lock_unlock(&s_playback_gain_lock);
    return result;
}

int bk7259_audio_playback_gain_get(float *gain_db) {
    int result = -1;

    if (!gain_db || aosl_static_lock_lock(&s_playback_gain_lock) < 0) {
        if (gain_db) {
            MYBOT_LOGE(TAG, "playback gain get lock failed");
        }
        return -1;
    }
    if (s_playback_gain_context && playback_gain_context_is_usable(s_playback_gain_context) &&
        onboard_speaker_stream_get_digital_gain(s_playback_gain_context->device, gain_db) == BK_OK) {
        result = 0;
    }
    if (result < 0) {
        MYBOT_LOGW(TAG, "playback gain get unavailable");
    }
    (void)aosl_static_lock_unlock(&s_playback_gain_lock);
    return result;
}

static int io_state_init(io_state_t *state) {
    if (!state) {
        MYBOT_LOGE(TAG, "audio I/O state: invalid context");
        return -1;
    }
    state->lock = aosl_lock_create();
    state->idle = aosl_cond_create();
    if (!state->lock || !state->idle) {
        if (state->idle) {
            aosl_cond_destroy(state->idle);
        }
        if (state->lock) {
            aosl_lock_destroy(state->lock);
        }
        MYBOT_LOGE(TAG, "audio I/O state allocation failed");
        return -1;
    }
    return 0;
}

static void io_state_destroy(io_state_t *state) {
    aosl_cond_destroy(state->idle);
    aosl_lock_destroy(state->lock);
}

