junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_audio.c
static bool io_begin(io_state_t *state) {
    aosl_lock_lock(state->lock);
    if (!state->started || state->stopping) {
        aosl_lock_unlock(state->lock);
        return false;
    }
    state->in_flight++;
    aosl_lock_unlock(state->lock);
    return true;
}

static bool io_end(io_state_t *state) {
    aosl_lock_lock(state->lock);
    state->in_flight--;
    bool stopping = state->stopping;
    if (state->stopping && state->in_flight == 0) {
        aosl_cond_broadcast(state->idle);
    }
    aosl_lock_unlock(state->lock);
    return stopping;
}

static bool io_begin_stop(io_state_t *state) {
    aosl_lock_lock(state->lock);
    while (state->stopping) {
        aosl_cond_wait(state->idle, state->lock);
    }
    if (!state->started) {
        aosl_lock_unlock(state->lock);
        return false;
    }
    state->stopping = true;
    aosl_lock_unlock(state->lock);
    return true;
}

static void io_wait_idle(io_state_t *state) {
    aosl_lock_lock(state->lock);
    while (state->in_flight != 0) {
        aosl_cond_wait(state->idle, state->lock);
    }
    aosl_lock_unlock(state->lock);
}

static void io_finish_stop(audio_context_t *ctx, bool failed) {
    aosl_lock_lock(ctx->io.lock);
    ctx->failed = ctx->failed || failed;
    ctx->io.started = false;
    ctx->io.stopping = false;
    aosl_cond_broadcast(ctx->io.idle);
    aosl_lock_unlock(ctx->io.lock);
}

/* Conversation-start power policy, mirroring the BK725x controller's
 * mybot_audio_bk725x_power_acquire(): raise the CPU to 480 MHz, keep the audio
 * subsystem out of sleep, and ask the Wi-Fi MAC for the fluent media profile.
 * The Wi-Fi media quality is deliberately not restored on release, exactly as
 * the controller leaves it. */
static int audio_pm_vote_on(void) {
    if (bk_pm_module_vote_cpu_freq(PM_DEV_ID_AUDIO, PM_CPU_FRQ_480M) != BK_OK) {
        MYBOT_LOGE(TAG, "audio CPU vote to 480 MHz failed");
        return -1;
    }
    if (bk_pm_module_vote_sleep_ctrl(PM_SLEEP_MODULE_NAME_AUDP, 0, 0) != BK_OK) {
        MYBOT_LOGE(TAG, "AUDP sleep-disable vote failed");
        if (bk_pm_module_vote_cpu_freq(PM_DEV_ID_AUDIO, PM_CPU_FRQ_DEFAULT) != BK_OK) {
            MYBOT_LOGE(TAG, "audio CPU vote rollback failed");
        }
        return -1;
    }
    if (bk_wifi_set_video_quality(WIFI_VIDEO_QUALITY_FD) != BK_OK) {
        MYBOT_LOGW(TAG, "Wi-Fi FD media-quality setting failed");
    }
    MYBOT_LOGI(TAG, "active: CPU=480 MHz, AUDP sleep=disabled, Wi-Fi quality=FD");
    return 0;
}

static int audio_pm_acquire(void) {
    int result = 0;

    if (aosl_static_lock_lock(&s_audio_pm_lock) < 0) {
        MYBOT_LOGE(TAG, "audio CPU vote lock failed");
        return -1;
    }
    if (s_audio_pm_users == 0 && audio_pm_vote_on() < 0) {
        result = -1;
    } else {
        s_audio_pm_users++;
        MYBOT_LOGI(TAG, "audio CPU vote acquired (users=%u)", s_audio_pm_users);
    }
    (void)aosl_static_lock_unlock(&s_audio_pm_lock);
    return result;
}

static void audio_pm_release(void) {
    if (aosl_static_lock_lock(&s_audio_pm_lock) < 0) {
        MYBOT_LOGE(TAG, "audio CPU vote release lock failed");
        return;
    }
    if (s_audio_pm_users != 0 && --s_audio_pm_users == 0) {
        if (bk_pm_module_vote_cpu_freq(PM_DEV_ID_AUDIO, PM_CPU_FRQ_DEFAULT) != BK_OK) {
            MYBOT_LOGE(TAG, "failed to release audio CPU frequency vote");
        } else {
            MYBOT_LOGI(TAG, "audio CPU vote released (users=0)");
        }
        if (bk_pm_module_vote_sleep_ctrl(PM_SLEEP_MODULE_NAME_AUDP, 1, 0) != BK_OK) {
            MYBOT_LOGE(TAG, "AUDP sleep-enable vote failed");
        }
    } else if (s_audio_pm_users != 0) {
        MYBOT_LOGI(TAG, "audio CPU vote retained (users=%u)", s_audio_pm_users);
    }
    (void)aosl_static_lock_unlock(&s_audio_pm_lock);
}

static bk_err_t discard_audio_event(audio_element_handle_t element,
                                    audio_event_iface_msg_t *event, void *user_data) {
    (void)element;
    (void)event;
    (void)user_data;
    return BK_OK;
}

static bool format_supported(int rate, int channels, int bits) {
    return rate == MYBOT_AUDIO_RATE && channels == MYBOT_AUDIO_CHANNELS &&
           bits == MYBOT_AUDIO_BITS;
}

static void audio_context_release(audio_context_t *ctx) {
    if (!ctx) {
        return;
    }

    MYBOT_LOGI(TAG, "audio context destroy begin");

    /* Serialize with gain set/get before the speaker element is deinitialized. */
    bk7259_audio_playback_gain_unpublish(ctx);

    if (ctx->pipeline) {
        (void)audio_pipeline_deinit(ctx->pipeline);
    }
    if (ctx->raw && !ctx->raw_registered) {
        (void)audio_element_deinit(ctx->raw);
    }
    if (ctx->device && !ctx->device_registered) {
        (void)audio_element_deinit(ctx->device);
    }
    if (ctx->aec && !ctx->aec_registered) {
        (void)audio_element_deinit(ctx->aec);
    }
    if (ctx->pm_acquired) {
        audio_pm_release();
        ctx->pm_acquired = false;
    }
    playback_owner_release(ctx);
    io_state_destroy(&ctx->io);
    aosl_free(ctx);
    MYBOT_LOGI(TAG, "audio context destroyed");
}

static int audio_context_start(audio_context_t *ctx) {
    if (!ctx || !ctx->pipeline) {
        MYBOT_LOGE(TAG, "audio pipeline start: invalid context");
        return -1;
    }

    aosl_lock_lock(ctx->io.lock);
    while (ctx->io.stopping) {
        aosl_cond_wait(ctx->io.idle, ctx->io.lock);
    }
    if (ctx->failed) {
        MYBOT_LOGW(TAG, "audio pipeline start rejected after previous failure");
        aosl_lock_unlock(ctx->io.lock);
        return -1;
    }
    if (ctx->io.started) {
        aosl_lock_unlock(ctx->io.lock);
        return 0;
    }
    if (audio_port_reset(ctx->raw_port) != BK_OK ||
        audio_pipeline_run(ctx->pipeline) != BK_OK) {
        ctx->failed = true;
        aosl_lock_unlock(ctx->io.lock);
        MYBOT_LOGE(TAG, "audio pipeline start failed");
        return -1;
    }
    ctx->io.started = true;
    aosl_lock_unlock(ctx->io.lock);
    MYBOT_LOGI(TAG, "audio pipeline started");
    return 0;
}

static int audio_context_abort_io(audio_context_t *ctx) {
    return ctx->raw_port && audio_port_abort(ctx->raw_port) == BK_OK ? 0 : -1;
}

