junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_audio.c
static int audio_context_stop(audio_context_t *ctx) {
    if (!ctx || !ctx->pipeline || !ctx->raw) {
        MYBOT_LOGE(TAG, "audio pipeline stop: invalid context");
        return -1;
    }
    if (!io_begin_stop(&ctx->io)) {
        return 0;
    }

    int result = audio_context_abort_io(ctx);
    if (result < 0) {
        MYBOT_LOGE(TAG, "audio raw I/O abort failed");
    }
    io_wait_idle(&ctx->io);
    if (audio_pipeline_stop(ctx->pipeline) != BK_OK) {
        MYBOT_LOGE(TAG, "audio pipeline stop failed");
        result = -1;
    }
    if (audio_pipeline_wait_for_stop(ctx->pipeline) != BK_OK) {
        MYBOT_LOGE(TAG, "audio pipeline wait-for-stop failed");
        result = -1;
    }
    io_finish_stop(ctx, result < 0);
    if (result == 0) {
        MYBOT_LOGI(TAG, "audio pipeline stopped");
    } else {
        MYBOT_LOGE(TAG, "audio pipeline stopped with errors");
    }
    return result;
}

static int capture_init(void **out_ctx, int rate, int channels, int bits) {
    const char *stage = "validate";

    if (!out_ctx || !format_supported(rate, channels, bits)) {
        MYBOT_LOGE(TAG, "capture init rejected: format=%d Hz/%d ch/%d bit", rate, channels,
                bits);
        return -1;
    }
    *out_ctx = NULL;
    MYBOT_LOGI(TAG, "capture init: format=%d Hz/%d ch/%d bit", rate, channels, bits);

    stage = "allocate";
    audio_context_t *ctx = aosl_calloc(1, sizeof(*ctx));
    if (!ctx || io_state_init(&ctx->io) < 0) {
        MYBOT_LOGE(TAG, "capture init failed at allocate");
        aosl_free(ctx);
        return -1;
    }
    stage = "audio_cpu_vote";
    if (audio_pm_acquire() < 0) {
        MYBOT_LOGE(TAG, "capture init failed at audio CPU vote");
        audio_context_release(ctx);
        return -1;
    }
    ctx->pm_acquired = true;

    stage = "pipeline";
    audio_pipeline_cfg_t pipeline_cfg = DEFAULT_AUDIO_PIPELINE_CONFIG();
    ctx->pipeline = audio_pipeline_init(&pipeline_cfg);
    if (!ctx->pipeline) {
        goto fail;
    }

    stage = "microphone";
    onboard_mic_stream_cfg_t mic_cfg = DEFAULT_ONBOARD_MIC_ADC_STREAM_CONFIG();
    mic_cfg.adc_cfg.chl_num = MYBOT_CAPTURE_MIC_CHANNELS;
    mic_cfg.adc_cfg.sample_rate = MYBOT_AUDIO_RATE;
    mic_cfg.adc_cfg.aec_en = 1;
    mic_cfg.adc_cfg.chl_cfg[1].bits = MYBOT_AUDIO_BITS;
    mic_cfg.adc_cfg.chl_cfg[1].dig_gain = 16.0f;
    mic_cfg.adc_cfg.chl_cfg[1].ana_gain = 20;
    mic_cfg.adc_cfg.chl_cfg[1].adc_mode = AUD_ADC_MODE_DIFFEN;
    mic_cfg.adc_cfg.chl_cfg[2].bits = MYBOT_AUDIO_BITS;
    mic_cfg.adc_cfg.chl_cfg[2].dig_gain = 16.0f;
    mic_cfg.adc_cfg.chl_cfg[2].ana_gain = 20;
    mic_cfg.adc_cfg.chl_cfg[2].adc_mode = AUD_ADC_MODE_DIFFEN;
    mic_cfg.dmic_cfg.dmic_clk_gpio = GPIO_50;
    mic_cfg.dmic_cfg.dmic_data_gpio = GPIO_49;
    mic_cfg.dmic_cfg.dmic_mode = AUD_DMIC_MODE_1;
    mic_cfg.dmic_cfg.channel = AUD_DMIC_CHANNEL_L;
    mic_cfg.dmic_en = 1;
    mic_cfg.frame_size = MYBOT_AUDIO_BLOCK_BYTES;
    mic_cfg.out_block_size = MYBOT_AUDIO_BLOCK_BYTES;
    mic_cfg.out_block_num = MYBOT_CAPTURE_DEVICE_BLOCKS;
    mic_cfg.multi_out_port_num = 0;
    mic_cfg.ch_bitmap = ONBOARD_MIC_ADC_ACTIVE_CH_1_BIT |
                        ONBOARD_MIC_ADC_ACTIVE_CH_2_BIT;
    mic_cfg.hw_ref_ch = ONBOARD_MIC_HW_REF_CH_NONE;
    ctx->device = onboard_mic_stream_init(&mic_cfg);
    if (!ctx->device ||
        audio_element_set_event_callback(ctx->device, discard_audio_event, NULL) != BK_OK) {
        goto fail;
    }

    /* The Robot V2 board has two PDM microphones on DMIC1. With aec_en=1 the
     * hardware appends the CALL echo-reference lane; AEC V2 consumes the two mic
     * lanes plus that reference and still outputs the mono PCM MyBot expects. */
    stage = "aec";
    aec_v3_algorithm_cfg_t aec_cfg = DEFAULT_AEC_V3_ALGORITHM_CONFIG();
    aec_cfg.aec_cfg.mode = AEC_MODE_HARDWARE;
    aec_cfg.aec_cfg.aec_loop = AEC_HW_REF_APPEND;
    aec_cfg.aec_cfg.adc_ch_num = MYBOT_CAPTURE_MIC_CHANNELS;
    aec_cfg.aec_cfg.ec_only_output = 1;
    aec_cfg.aec_cfg.multi_output_use_ec_out = 1;
    aec_cfg.aec_cfg.ns_type = NS_TRADITION;
    aec_cfg.dual_ch = 1;
    aec_cfg.out_block_num = MYBOT_CAPTURE_DEVICE_BLOCKS;
    ctx->aec = aec_v3_algorithm_init(&aec_cfg);
    if (!ctx->aec ||
        audio_element_set_event_callback(ctx->aec, discard_audio_event, NULL) != BK_OK) {
        goto fail;
    }

    stage = "raw_stream";
    raw_stream_cfg_t raw_cfg = RAW_STREAM_CFG_DEFAULT();
    raw_cfg.type = AUDIO_STREAM_READER;
    ctx->raw = raw_stream_init(&raw_cfg);
    if (!ctx->raw ||
        audio_element_set_input_timeout(
            ctx->raw, BK_MS_TO_TICKS(MYBOT_AUDIO_IO_TIMEOUT_MS)) != BK_OK ||
        audio_element_set_event_callback(ctx->raw, discard_audio_event, NULL) != BK_OK) {
        goto fail;
    }

    stage = "register_microphone";
    if (audio_pipeline_register(ctx->pipeline, ctx->device, "mic") != BK_OK) {
        goto fail;
    }
    ctx->device_registered = true;
    stage = "register_aec";
    if (audio_pipeline_register(ctx->pipeline, ctx->aec, "aec") != BK_OK) {
        goto fail;
    }
    ctx->aec_registered = true;
    stage = "register_raw_stream";
    if (audio_pipeline_register(ctx->pipeline, ctx->raw, "raw") != BK_OK) {
        goto fail;
    }
    ctx->raw_registered = true;

    stage = "link";
    const char *links[] = {"mic", "aec", "raw"};
    if (audio_pipeline_link(ctx->pipeline, links, 3) != BK_OK) {
        goto fail;
    }
    stage = "raw_port";
    ctx->raw_port = audio_element_get_input_port(ctx->raw);
    if (!ctx->raw_port) {
        goto fail;
    }

    *out_ctx = ctx;
    MYBOT_LOGI(TAG, "capture ready");
    return 0;

fail:
    MYBOT_LOGE(TAG, "capture init failed at %s", stage);
    audio_context_release(ctx);
    return -1;
}

static int capture_start(void *opaque) {
    MYBOT_LOGI(TAG, "capture start requested");
    return audio_context_start(opaque);
}

static int capture_read(void *opaque, void *buf, int frames) {
    audio_context_t *ctx = opaque;
    if (!ctx || !ctx->raw || !buf || frames <= 0 ||
        frames > INT_MAX / (int)sizeof(int16_t)) {
        return -1;
    }
    if (!io_begin(&ctx->io)) {
        return -1;
    }

