junlon2006/bk_solution_ai/components/mybot/mybot_sdk/platforms/bk7259/bk7259_audio.c
    int requested_bytes = frames * (int)sizeof(int16_t);
    int bytes = raw_stream_read(ctx->raw, buf, requested_bytes);
    bool stopping = io_end(&ctx->io);
    if (bytes == 0 || bytes == AEL_IO_TIMEOUT ||
        (bytes == AEL_IO_ABORT && stopping)) {
        return 0;
    }
    if (bytes < 0 || bytes > requested_bytes ||
        (bytes % (int)sizeof(int16_t)) != 0) {
        return -1;
    }
    return bytes / (int)sizeof(int16_t);
}

static int capture_stop(void *opaque) {
    MYBOT_LOGI(TAG, "capture stop requested");
    return audio_context_stop(opaque);
}

static void capture_destroy(void *opaque) {
    audio_context_t *ctx = opaque;
    if (!ctx) {
        return;
    }
    MYBOT_LOGI(TAG, "capture destroy requested");
    (void)audio_context_stop(ctx);
    audio_context_release(ctx);
}

static int playback_init(void **out_ctx, int rate, int channels, int bits) {
    const char *stage = "validate";

    if (!out_ctx || !format_supported(rate, channels, bits)) {
        MYBOT_LOGE(TAG, "playback init rejected: format=%d Hz/%d ch/%d bit", rate, channels,
                bits);
        return -1;
    }
    *out_ctx = NULL;
    MYBOT_LOGI(TAG, "playback init: format=%d Hz/%d ch/%d bit", rate, channels, bits);

    stage = "allocate";
    audio_context_t *ctx = aosl_calloc(1, sizeof(*ctx));
    if (!ctx || io_state_init(&ctx->io) < 0) {
        MYBOT_LOGE(TAG, "playback init failed at allocate");
        aosl_free(ctx);
        return -1;
    }
    stage = "playback_owner";
    if (playback_owner_acquire(ctx) < 0) {
        MYBOT_LOGE(TAG, "playback init failed at playback owner");
        io_state_destroy(&ctx->io);
        aosl_free(ctx);
        return -1;
    }
    stage = "audio_cpu_vote";
    if (audio_pm_acquire() < 0) {
        MYBOT_LOGE(TAG, "playback init failed at audio CPU vote");
        audio_context_release(ctx);
        return -1;
    }
    ctx->pm_acquired = true;

    stage = "pipeline";
    audio_pipeline_cfg_t pipeline_cfg = DEFAULT_AUDIO_PIPELINE_CONFIG();
    ctx->pipeline = audio_pipeline_init(&pipeline_cfg);
    if (!ctx->pipeline) {
        goto fail;
    }

    stage = "raw_stream";
    raw_stream_cfg_t raw_cfg = {
        .type = AUDIO_STREAM_WRITER,
        .out_block_size = MYBOT_AUDIO_BLOCK_BYTES,
        .out_block_num = MYBOT_PLAYBACK_RAW_BLOCKS,
        .output_port_type = PORT_TYPE_RB,
    };
    ctx->raw = raw_stream_init(&raw_cfg);
    if (!ctx->raw ||
        audio_element_set_output_timeout(
            ctx->raw, BK_MS_TO_TICKS(MYBOT_AUDIO_IO_TIMEOUT_MS)) != BK_OK) {
        goto fail;
    }

    stage = "speaker";
    onboard_speaker_stream_cfg_t speaker_cfg = DEFAULT_ONBOARD_SPEAKER_STREAM_CONFIG();
    speaker_cfg.chl_num = MYBOT_AUDIO_CHANNELS;
    speaker_cfg.bits = MYBOT_AUDIO_BITS;
    speaker_cfg.multi_in_port_num = 0;
    speaker_cfg.multi_out_port_num = 0;
    speaker_cfg.dac_source_bitmap = ONBOARD_SPEAKER_STREAM_DAC_SOURCE_CALL_BIT;
    speaker_cfg.main_dac_source = AUD_DAC_SOURCE_CALL;
    speaker_cfg.sample_rate[AUD_DAC_SOURCE_CALL] = MYBOT_AUDIO_RATE;
    speaker_cfg.frame_size[AUD_DAC_SOURCE_CALL] = MYBOT_AUDIO_BLOCK_BYTES;
    speaker_cfg.pool_length = MYBOT_AUDIO_POOL_BYTES;
    speaker_cfg.pa_ctrl_en = true;
    speaker_cfg.pa_ctrl_gpio = 20;
    speaker_cfg.pa_on_level = 1;
    speaker_cfg.pa_on_delay = 10;
    speaker_cfg.pa_off_delay = 30;
    ctx->device = onboard_speaker_stream_init(&speaker_cfg);
    if (!ctx->device ||
        audio_element_set_event_callback(ctx->raw, discard_audio_event, NULL) != BK_OK ||
        audio_element_set_event_callback(ctx->device, discard_audio_event, NULL) != BK_OK) {
        goto fail;
    }

    stage = "register_raw_stream";
    if (audio_pipeline_register(ctx->pipeline, ctx->raw, "raw") != BK_OK) {
        goto fail;
    }
    ctx->raw_registered = true;
    stage = "register_speaker";
    if (audio_pipeline_register(ctx->pipeline, ctx->device, "speaker") != BK_OK) {
        goto fail;
    }
    ctx->device_registered = true;

    stage = "link";
    const char *links[] = {"raw", "speaker"};
    if (audio_pipeline_link(ctx->pipeline, links, 2) != BK_OK) {
        goto fail;
    }
    stage = "raw_port";
    ctx->raw_port = audio_element_get_output_port(ctx->raw);
    if (!ctx->raw_port) {
        goto fail;
    }

    stage = "publish_gain";
    if (bk7259_audio_playback_gain_publish(ctx) < 0) {
        goto fail;
    }

    *out_ctx = ctx;
    MYBOT_LOGI(TAG, "playback ready");
    return 0;

fail:
    MYBOT_LOGE(TAG, "playback init failed at %s", stage);
    audio_context_release(ctx);
    return -1;
}

static int playback_start(void *opaque) {
    MYBOT_LOGI(TAG, "playback start requested");
    int result = audio_context_start(opaque);
    if (result < 0) {
        return result;
    }
    if (bk7259_audio_playback_gain_publish(opaque) < 0) {
        MYBOT_LOGE(TAG, "playback start failed to publish gain context");
        (void)audio_context_stop(opaque);
        return -1;
    }
    return 0;
}

static int playback_write(void *opaque, const void *buf, int frames) {
    audio_context_t *ctx = opaque;
    if (!ctx || !ctx->raw || !buf || frames <= 0 ||
        frames > INT_MAX / (int)sizeof(int16_t)) {
        return -1;
    }
    if (!io_begin(&ctx->io)) {
        return -1;
    }

    int requested_bytes = frames * (int)sizeof(int16_t);
    int bytes = raw_stream_write(ctx->raw, (char *)buf, requested_bytes);
    bool stopping = io_end(&ctx->io);
    if (bytes == 0 || bytes == AEL_IO_TIMEOUT ||
        (bytes == AEL_IO_ABORT && stopping)) {
        return 0;
    }
    if (bytes < 0 || bytes > requested_bytes ||
        (bytes % (int)sizeof(int16_t)) != 0) {
        return -1;
    }
    return bytes / (int)sizeof(int16_t);
}

static int playback_stop(void *opaque) {
    /* Stop accepting gain operations before interrupting the pipeline. */
    MYBOT_LOGI(TAG, "playback stop requested");
    bk7259_audio_playback_gain_unpublish(opaque);
    return audio_context_stop(opaque);
}

static void playback_destroy(void *opaque) {
    audio_context_t *ctx = opaque;
    if (!ctx) {
        return;
    }
    MYBOT_LOGI(TAG, "playback destroy requested");
    bk7259_audio_playback_gain_unpublish(ctx);
    (void)audio_context_stop(ctx);
    audio_context_release(ctx);
}

const mybot_audio_capture_ops_t g_mybot_bk7259_capture_ops = {
    .init = capture_init,
    .start = capture_start,
    .read = capture_read,
    .stop = capture_stop,
    .destroy = capture_destroy,
};

const mybot_audio_playback_ops_t g_mybot_bk7259_playback_ops = {
    .init = playback_init,
    .start = playback_start,
    .write = playback_write,
    .stop = playback_stop,
    .destroy = playback_destroy,
};
